{
 "sampleFiles":
[
  {
    "hasRelativeAssetsUrls": false,
    "path": "../../samples/layouts/accordion/overview/App.razor",
    "content": "\n@using IgniteUI.Blazor.Controls\n\n<div class=\"container vertical\">\n    <IgbSwitch Change=\"OnSwitchChange\">Single Expand</IgbSwitch>\n    <IgbAccordion SingleExpand=\"@SingleExpand\">\n        <IgbExpansionPanel>\n            <h3 slot=\"title\">What has changed about subscription and pricing model?</h3>\n            <span>\n                We have moved to a subscription-based pricing model for all our developer tools. This makes it easier\n                for you to manage your license subscriptions and allows us to provide a better level of service for you. We\n                updated our pricing and packages to provide you with flexible options and the best value. This includes Ignite UI\n                (formerly Ignite UI for JavaScript) which includes all of our JavaScript framework components for web development,\n                including: Angular, ASP.NET (Core and MVC), Blazor, JQuery, React and Web Components), as well as Infragistics Professional,\n                Infragistics Ultimate, our Ultimate UI products. We also offer multi-year subscriptions options with a built-in discount,\n                so you can see the value up front. With these updates we are confident that we are providing the best platforms and the best\n                price.\n            </span>\n        </IgbExpansionPanel>\n        <IgbExpansionPanel>\n            <h3 slot=\"title\">Who will the updated changes impact?</h3>\n            <span>\n                The license updates will impact all new and current customers using Ignite UI, Infragistics Professional and\n                Infragistics Ultimate. Specifically, we have also made updates to our product and packaging for Ignite UI for JavaScript,\n                Ignite UI for Angular, Ignite UI for React and Ignite UI for Web components. For more information, please refer to this\n                blog: Announcement: Changes to Ignite UI Product & Packaging The pricing has been updated for all products and packages.\n                So, all new or additional licenses will be sold based on our new pricing and packages. All existing license agreements will\n                be honored and renewed based upon the current agreement.\n            </span>\n        </IgbExpansionPanel>\n        <IgbExpansionPanel>\n            <h3 slot=\"title\">What is the difference between your old model and your current subscription model for Ignite UI?</h3>\n            <span>\n                For Ignite UI customers, we are moving away from NPM for licensed packages. The current NPM packages will be replaced with\n                packages that include a “Trial Version” watermark. Licensed packages for Ignite UI will be available from our cloud hosted ProGet\n                server. For more information, please refer to this article: Moving from Trial to Licensed Ignite UI NPM Packages\n            </span>\n        </IgbExpansionPanel>\n        <IgbExpansionPanel>\n            <h3 slot=\"title\">What happens if I don't renew my subscription?</h3>\n            <span>Any unlicensed or trial versions of Ignite UI for Angular, React and Web Components will now include this watermark.</span >\n        </IgbExpansionPanel>\n        <IgbExpansionPanel>\n            <h3 slot=\"title\">If I don't renew my subscription will I still have access to previous versions of Infragistics products?</h3>\n            <span>\n                Any version of Infragistics software which you have downloaded can continue to be used perpetually. Access to download any new or\n                previous versions through our customer portal and package feeds will require maintaining an active subscription by continuing\n                to renew it.\n            </span>\n        </IgbExpansionPanel>\n    </IgbAccordion>\n</div>\n\n@code {\n    \n    public bool SingleExpand { get; set; }\n\n    public void OnSwitchChange(IgbComponentBoolValueChangedEventArgs args)\n    {\n        SingleExpand = args.Detail;\n    }\n}",
    "isMain": true,
    "fileExtension": "razor",
    "fileHeader": "razor"
  },
  {
    "hasRelativeAssetsUrls": false,
    "path": "../../samples/layouts/accordion/overview/Program.cs",
    "content": "using System;\nusing System.Net.Http;\nusing Microsoft.AspNetCore.Components.Web;\nusing Microsoft.AspNetCore.Components.WebAssembly.Hosting;\nusing Microsoft.Extensions.Configuration;\nusing Microsoft.Extensions.DependencyInjection;\nusing Microsoft.Extensions.Logging;\nusing IgniteUI.Blazor.Controls; // for registering Ignite UI modules\nusing BlazorClientApp;\n\nvar builder = WebAssemblyHostBuilder.CreateDefault(args);\nbuilder.RootComponents.Add<App>(\"app\");\nbuilder.RootComponents.Add<HeadOutlet>(\"head::after\");\n\nbuilder.Services.AddScoped(sp => new HttpClient { BaseAddress = new Uri(builder.HostEnvironment.BaseAddress) });\n\nbuilder.Services.AddIgniteUIBlazor(\n    typeof(IgbIconModule),\n    typeof(IgbDateTimeInputModule),\n    typeof(IgbRadioGroupModule),\n    typeof(IgbRadioModule),\n    typeof(IgbRatingModule),\n    typeof(IgbAccordionModule),\n    typeof(IgbExpansionPanelModule),\n    typeof(IgbCheckboxModule),\n    typeof(IgbSliderModule),\n    typeof(IgbRangeSliderModule)\n);\n\nawait builder.Build().RunAsync();",
    "isMain": true,
    "fileExtension": "cs",
    "fileHeader": "MODULES"
  }
]
}